{
	"depts" : [
		{
			"name": "Command",
			"jobs": [
				{
					"titles" : ["Commanding Officer"],
					"rates" : {"ec" : ["O6"]},
					"desc" : "The Commanding Officer (CO) or, in more casual settings, the Captain, is in charge of the SEV Torch and everything on it. It is their duty to make sure the SEV Torch carries out its mission, and makes it back to Sol in one piece. They are expected to be able to command their Heads of Staff effectively to ensure that all departments are running smoothly. They are the ultimate authority on the Torch, and have authorization to access anywhere on board, as well as the power to issue orders essentially without limit.\n\nObviously, as the role possesses so much power, it is recommended that only experienced players attempt the Commanding Officer position."
				},
				{
					"titles" : ["Executive Officer"],
					"rates" : {"ec" : ["O5"], "fleet" : ["O4", "O5"]},
					"desc" : "The Executive Officer, also known as the XO, is responsible for making sure that all station departments aboard the SEV Torch are well-staffed and running optimally. As such, they are entrusted with the ability to modify crew assignments and access levels via an ID modifier console, something that only the Commanding Officer or AI can do otherwise. They are also responsible for managing the Supply and Service departments, as well as managing any personnel without an active Head of Staff.\n\nThe Executive Officer answers directly to the Commanding Officer, and is considered second-in-command both in terms of position and (usually) military rank."
				},
				{
					"titles" : ["Senior Enlisted Advisor"],
					"rates" : {"fleet" : ["E8", "E9", "E9a"]},
					"desc" : "The Senior Enlisted Advisor, often shortened to SEA, is tasked primarily with the efficient running of the SEV Torch, ensuring standards, regulations and procedure are being met, enforcing these regulations on enlisted personnel as appropriate, and advising the Executive Officer and Commanding Officer on matters pertaining to enlisted personnel or the ship at large. The Senior Enlisted Advisor is considered one of the \"big three\" crew members ultimately in charge of the vessel, alongside the Executive and Commanding Officers."
				},
				{
					"titles" : ["Bridge Officer"],
					"rates" : {"ec" : ["O1"], "fleet" : ["O1"]},
					"desc" : "The Bridge Officer is essentially an assistant to the rest of the Command department aboard the SEV Torch, responsible for monitoring various aspects of the ship's systems and communications, piloting the Torch, and bringing any issues to the attention of the appropriate personnel. The Bridge Officer is a good introduction and starting job for these wishing to delve into Command.\n\nBridge Officers answer directly to the Commanding Officer and Executive Officer but are outranked by line officers such as the Chief Engineer, Chief Medical Officer, or Chief of Security."
				},
				{
					"titles" : ["SolGov Representative"],
					"rates" : {"scg" : ["gov"]},
					"desc" : "The SolGov Representative (or SCGR) is a unique civilian role on board the SEV Torch who represents the interests of the Sol Central Government on board the vessel."
				},
				{
					"titles" : ["Workplace Liason", "Corporate Representative", "Corporate Executive", "Union Representative"],
					"rates" : {"civ" : ["contractor"]},
					"desc" : "The Corporate Liaison is a unique role on board the Torch. They represent the mega-corporation Expeditionary Corps Organisations board of directors on board the SEV Torch, and they are responsible for both overseeing research operations and ensuring that Torch Command takes the desires of its corporate partners into account when deciding upon matters of ship procedure and planning. The Liaison investigates possible breaches of corporate regulations, reports to EXO via fax machine, and acts according to the company's orders.\n\nThe Liaison technically answers only to the board of directors, as explained below. An intelligent Liaison, however, will think very carefully before disobeying instructions from the Commanding Officer or other Command personnel."
				}
			]
		},
		{
			"name": "Engineering",
			"jobs": [
				{
					"titles" : ["Chief Engineer"],
					"rates" : {"ec" : ["O3"], "fleet" : ["O2", "O3"]},
					"desc" : "The Chief Engineer, also called the CE, is in charge of the integrity of the SEV Torch and the ship AI's structural well-being. That means making sure that breaches are sealed promptly, that equipment remains operational, and that the AI doesn't get any weird laws. As the head of the Engineering department, they have authority over the ship's Engineers and Maintenance Assistants, and issue orders to ensure that they set up the engine correctly, that Atmospherics is properly configured, and that any mechanical faults are corrected quickly and efficiently. Towards this end, they have the Senior Engineer to act as their right hand; the Chief Engineer issues orders, and the Senior Engineer ensures that those orders are carried out. This frees up the Chief Engineer from having to worry about the details of execution, allowing them to focus on coordinating with the rest of Command and making big-picture decisions, rather than having to perform standard repairs.\n\nAs a line officer and department head, the Chief Engineer answers directly to the Executive Officer and the Commanding Officer."
				},
				{
					"titles" : ["Senior Engineer"],
					"rates" : {"ec" : ["E7"], "fleet" : ["E6", "E7", "E8"]},
					"desc" : "The Senior Engineer is the most senior and experienced enlisted member of the standard Engineering crew aboard the SEV Torch, and is responsible for overseeing the day-to-day operations of the department. They are in charge of seeing that the rest of the schlubs in the department know what they're supposed to be doing, and that they are actually doing so quickly and professionally. It is their job to translate the Chief Engineer's orders into actions, and to oversee those actions to be certain that everything is done correctly.\n\nThey are the executive to the Chief Engineer's administrator, the Sergeant to the commissioned officer, the one that turns the list of priorities and instructions into actual work by the rest of the department. They are the middle-man between the CE and the rest of Engineering, and they should coordinate closely with both.\n\nAs a senior enlisted crew member, the Senior Engineer answers directly to the Chief Engineer."
				},
				{
					"titles" : ["Engineer"],
					"rates" : {"ec" : ["E3", "E5"], "fleet" : ["E2", "E3", "E4", "E5"]},
					"desc" : "The Ship Engineer, also more commonly known as just the Engineer is one of the central lynchpins that keeps the SEV Torch whizzing along through space. Almost all of the ship's bare essentials can be traced back to its Engineering staff: they keep the ship powered, breathing, not bathing in radioactivity, in good repair, and with functioning and unbroken lightbulbs, even in the case of unfortunate accidents. Almost any machinery-related issue on board the Torch is the ultimate responsibility of the ship Engineers.\n\nThe ship's Engineers answer directly to both the Chief Engineer and Senior Engineer. The Chief Engineer is the ultimate authority in the department, but the Senior Engineer is responsible for seeing that the Chief Engineer's orders are carried out, and they are generally also the most experienced and highest-ranking of the rank-and-file Engineering staff."
				},
				{
					"titles" : ["Engineer Trainee"],
					"rates" : {"ec" : ["E3"], "fleet" : ["E2"]},
					"desc" : "There is no description for this role."
				},
				{
					"titles" : ["Engineering Contractor"],
					"rates" : {"civ" : ["contractor"]},
					"desc" : "The Engineering Contractor is, broadly speaking, the civilian equivalent of the crew Engineer, and most things that apply to Engineers apply to the Engineering Contractor. It is a wide-ranging job covering everything from entry-level Engineering personnel just learning the ropes to highly specialized contracted personnel hired to maintain specific, complicated subsystems on board the Torch.\n\nAs part of the Engineering department, the Engineering Contractor answers to the Chief Engineer and Senior Engineer. The Chief Engineer is the ultimate authority in the department, but the Senior Engineer is responsible for seeing that the Chief Engineer's orders are carried out, and they are generally also the most experienced and highest-ranking of the rank-and-file Engineering staff."
				},
				{
					"titles" : ["Roboticist", "Mechsuit Technician"],
					"rates" : {"civ" : ["contractor"]},
					"desc" : "The ship Roboticist is primarily concerned with the production and maintenance of the ship's Cyborgs and robots. They may also be called upon to build a variety of exosuits, repair prosthetic limbs on various crew members, or transplant someone's brain into a cyborg shell or full-body prosthetic unit.\n\nAs part of the Engineering department, the Roboticist answers to the Chief Engineer."
				}
			]
		},
		{
			"name": "Exploration",
			"jobs": [
				{
					"titles" : ["Pathfinder"],
					"rates" : {"ec" : ["O1"]},
					"desc" : "The Pathfinder is the individual in charge of away missions on the government's side. They're leading a team of hardy Explorers to find any exploitable resources or scientific oddities throughout uncharted space, whether it's planet-bound or in an abandoned ship - the Pathfinder is responsible for getting it done. The Pathfinder is only ever an Expeditionary Corps Ensign (O-1), and is a staff officer who reports directly to the Executive Officer and Commanding Officer."
				},
				{
					"titles" : ["Shuttle Pilot"],
					"rates" : {"civ" : ["contractor"], "ec" : ["E7"], "fleet" : ["E6", "E7"]},
					"desc" : "The Shuttle Pilot is the dedicated pilot for any away missions. The Shuttle Pilot answers to the Pathfinder."
				},
				{
					"titles" : ["Explorer"],
					"rates" : {"ec" : ["E3", "E5"]},
					"desc" : "The Explorer is the bread and butter of the Expeditionary Corps and help further the mission of the SEV Torch in deep space exploration. Led by the Pathfinder, their job is to embark on away missions and make new discoveries in the name of Sol Central Government."
				}
			]
		},
		{
			"name": "Medical",
			"jobs": [
				{
					"titles" : ["Chief Medical Officer"],
					"rates" : {"ec" : ["O3"], "fleet" : ["O3", "O4"]},
					"desc" : "The Chief Medical Officer, otherwise known as the CMO, is the ultimate authority when it comes to preserving the health of the crew aboard the SEV Torch. They make sure that the ship's Physicians are treating people effectively, that the Corpsmen are responding to emergency calls, that the Chemist is producing the needed medication, and that the Counselor is helping to keep the crew mentally stable.\n\nTheir department and usual place of work is in the Infirmary or Medical Bay on the first deck of the ship.\n\nAs the foremost medical professional on the ship, the CMO is expected to have the necessary knowledge and expertise to perform most - if not all - of the operations required by the department. However, their job is not to be the ultimate super-doctor; rather, it is to coordinate the efforts of their subordinates, only taking a direct hand in matters when absolutely necessary. The day-to-day operations of the department are under the purview of the Physicians, whereas the Chief Medical Officer exists to make sure that the Infirmary staff are well-equipped, well-informed, and well-coordinated."
				},
				{
					"titles" : ["Physician", "Surgeon", "Trauma Surgeon"],
					"rates" : {"ec" : ["O1"], "fleet" : ["O1", "O2"]},
					"desc" : "The Physician is the primary Medical role and practitioner aboard the SEV Torch. Unlike the Corpsman, who is generally concerned with retrieving patients from the field and acting as a gopher for other Medical personnel, the Physician is expected to perform intensive medicine on a regular basis, ranging from checkups with the crew to intensive surgery. They are the main workhorse for the department, and should be ready to handle all manner of medical emergencies should they arise. As such, it is important to familiarize yourself with the systems involved by reading the Related Guides linked in the sidebar; odds are that you'll need to know everything contained in them at some point or another.\n\nPhysicians are staff officers and answer directly to the Chief Medical Officer."
				},
				{
					"titles" : ["Corpsman", "Field Medic", "Paramedic"],
					"rates" : {"ec" : ["E3", "E5"], "fleet" : ["E2", "E3", "E4", "E5", "E6"]},
					"desc" : "The Corpsman is the primary medical first responder aboard the SEV Torch and, next to the Physician, the most vital part of the Medical machine. While the Physician handles most of the intensive cases, Corpsmen are tasked with the retrieval and stabilization of these patients. When a member of the crew is critically wounded and can't reach the Infirmary, it's the Corpsman's job to go and retrieve them. When there's a state of emergency on board the ship, it's the Corpsman's job to watch the sensors and make sure that no one's gotten hurt. When the Medbay is clogged with patients and the Physician is locked up in the operating theater, it's the Corpsman's job to make sure no one dies in the interim. When the Physician needs an extra pair of hands to keep a patient stable, it's the Corpsman's job to provide.\n\nYou may not hold a scalpel, or even a medical degree, but without you, Medical doesn't function. So put on your First Responder jacket, load up your medical belt, and make sure to keep those stasis bags handy. It's time to save some lives.\n\nAs enlisted personnel, Corpsmen answer directly to both Physicians and the Chief Medical Officer. You take orders from both, but the Chief Medical Officer is your ultimate boss, and their orders take priority."
				},
				{
					"titles" : ["Medical Contractor"],
					"rates" : {"civ" : ["contractor"]},
					"desc" : "The Medical Contractor is a catch-all role for civilian doctors, and covers a variety of specialist fields depending on which specific title is selected. The specific job description varies according to this also, but all Medical Contractors, as contracted personnel, are technically supposed to obey orders from all crew in the Medical department, no matter how low their rank. Given that Medical work is more a matter of qualifications than of rank, however, it's rare to see a Corpsman trying to issue orders to a Xenosurgeon or Virologist.\n\nLike all other Medical personnel, though, Contractors still answer to the Chief Medical Officer."
				},
				{
					"titles" : ["Biomechanical Engineer"],
					"rates" : {"civ" : ["contractor"]},
					"desc" : "There is no description for this role."
				},
				{
					"titles" : ["Counselor", "Chaplain", "Psychologist", "Psychiatrist"],
					"rates" : {"civ" : ["contractor"], "ec" : ["O1"], "fleet" : ["O1", "O2"]},
					"desc" : "The Counselor is the primary person responsible for the mental health and well-being of all personnel aboard the SEV Torch. While Physicians and Corpsmen are largely tasked with the physical well-being of the various persons aboard the Torch, the Counselor is concerned with their psychological health. They are also responsible for supplying religious services to crew who desire them, and for performing funeral rites.\n\nAs with other Medical personnel, the Counselor answers directly to the Chief Medical Officer."
				},
				{
					"titles" : ["Chemist", "Pharmacist"],
					"rates" : {"civ" : ["contractor"]},
					"desc" : "The Chemist is the member of Medical staff responsible for creating medications for the Physicians and Corpsmen to use. They do little, if anything, in the way of hands-on doctoring, and are primarily concerned with making sure that the rest of the department has the drugs necessary to do their jobs. They also fill prescriptions for any member of the crew that requires them, and can create a variety of interesting non-medicinal concoctions in their laboratory if the need arises.\n\nAs a contractor, the Chemist answers directly to the Chief Medical Officer and, indirectly, any enlisted personnel or commissioned officers in the department."
				}
			]
		},
		{
			"name": "Research",
			"jobs": [
				{
					"titles" : ["Research Director"],
					"rates" : {"civ" : ["contractor"]},
					"desc" : "The Research Director is, along with the Corporate Liaison, the primary voice of corporate interest on board the Torch. They are responsible for administrating the activities of the ship's Scientists and other Research staff to ensure that corporate progress (and profit) is progressing optimally.\n\nThe Research Director answers to the Commanding Officer."
				},
				{
					"titles" : ["Senior Researcher"],
					"rates" : {"civ" : ["contractor"]},
					"desc" : "The most senior member of the Research crew, the Senior Researcher is in charge of seeing that the rest of the schlubs in the department know what they're supposed to be doing, and are actually doing so quickly and professionally. It is their job to translate the Research Director's orders into actions, and to oversee the day-to-day operations of the department to be certain that everything is done correctly. They are the executive to the Research Director's administrator, the Sergeant to the commissioned officer, the one that turns the list of priorities and instructions into actual work by the rest of the department.\n\nThey are the middle-man between the RD and the rest of Research, and should coordinate closely with both."
				},
				{
					"titles" : ["Scientist", "Researcher", "Anomalist", "Xenoarchaeologist", "Xenobiologist", "Xenobotanist"],
					"rates" : {"civ" : ["contractor"]},
					"desc" : "The Scientist is one of the most freeform and wide-ranging jobs aboard the ship. Being a Scientist on the Torch means you can make and research loads of unique tools and gadgets, construct highly explosive or highly useful bombs, fly away to both mundane and strange places outside the ship on the Charon or the Guppy for mining or archaeological purposes, and even interact with the occasional alien life.\n\nScientists answer to the Senior Researcher and Research Director under most circumstances. If neither of these personnel are available, Scientists answer to the Corporate Liaison."
				},
				{
					"titles" : ["Xenolife Technician"],
					"rates" : {"ec" : ["E5", "E7", "O1"]},
					"desc" : "The Xenolife Technician is a uniformed Scientist. The Xenolife Technician reports to the Research Director."
				},
				{
					"titles" : ["Security Guard"],
					"rates" : {"civ" : ["contractor"]},
					"desc" : "The Security Guard is the research division's dedicated asset protection force on board the Torch. Their primary job is to keep the Research department safe from any and all threats, up to and including the incompetent Scientists themselves, and thus preserve the company's precious investments.\n\nThe Security Guard answers to the Research Director. If there is no Research Director, they should follow research's chain of command on board - the Senior Researcher and Corporate Liaison."
				},
				{
					"titles" : ["Research Assistant", "Custodian", "Testing Assistant", "Laboratory Technician", "Intern", "Clerk", "Field Assistant"],
					"rates" : {"civ" : ["contractor"], "scg" : ["scientist"]},
					"desc" : "The Research Assistant is a catch-all job for various types of laboratory helpers. It serves mainly to help the Scientists in any way they require, and, due to this, serves as an excellent entry point for newer players wanting to learn more about Research.\n\nResearch Assistants normally answer to the Senior Researcher and Research Director, with the Director's orders taking precedence. If neither of these personnel are present, Research Assistants answer to the Corporate Liaison."
				}
			]
		},
		{
			"name": "Security",
			"jobs": [
				{
					"titles" : ["Chief of Security"],
					"rates" : {"ec" : ["O3"], "fleet" : ["O2", "O3"]},
					"desc" : "Test"
				},
				{
					"titles" : ["Brig Officer"],
					"rates" : {"ec" : ["E7"], "fleet" : ["E6", "E7", "E8"]},
					"desc" : "Test"
				},
				{
					"titles" : ["Forensic Technician"],
					"rates" : {"civ" : ["contractor"], "ec" : ["E3", "E5"], "fleet" : ["E4", "E5"], "scg" : ["agent"]},
					"desc" : "Test"
				},
				{
					"titles" : ["Master at Arms"],
					"rates" : {"ec" : ["E3"], "fleet" : ["E2", "E3", "E4"]},
					"desc" : "Test"
				}
			]
		},
		{
			"name": "Service",
			"jobs": [
				{
					"titles" : ["Sanitation Technician"],
					"rates" : {"civ" : ["contractor"], "ec" : ["E3"], "fleet" : ["E2", "E3", "E4"]},
					"desc" : "Test"
				},
				{
					"titles" : ["Cook", "Chef", "Culinary Specialist"],
					"rates" : {"civ" : ["contractor"], "ec" : ["E3"], "fleet" : ["E2", "E3", "E4"]},
					"desc" : "Test"
				},
				{
					"titles" : ["Bartender"],
					"rates" : {"civ" : ["contractor"]},
					"desc" : "Test"
				},
				{
					"titles" : ["Crewman"],
					"rates" : {"ec" : ["E3"], "fleet" : ["E2", "E3", "E4"]},
					"desc" : "Test"
				}
			]
		},
		{
			"name": "Supply",
			"jobs": [
				{
					"titles" : ["Deck Chief"],
					"rates" : {"ec" : ["E7"], "fleet" : ["E6", "E7", "E8"]},
					"desc" : "The Deck Chief, also known as the DC, is tasked with running the Cargo Bay. They are primarily concerned with approving orders given to the Supply department and ensuring that the Deck Technicians do their jobs in making sure that said orders are received, catalogued, and shipped out to their proper destinations.\n\nAs part of the Supply department, the Deck Chief answers to the Executive Officer."
				},
				{
					"titles" : ["Deck Technician"],
					"rates" : {"ec" : ["E3"], "fleet" : ["E2", "E3", "E4"]},
					"desc" : "The Deck Technician is the grunt worker of the Cargo Bay. They are responsible for sending mail, receiving cargo, and generally ensuring that all the deliveries to the Supply department get where they need to go.\n\nAs members of the Supply department, Deck Technicians answer to both the Deck Chief and the Executive Officer, though the Deck Chief is by far the more active of the two in this regard."
				},
				{
					"titles" : ["Supply Assistant"],
					"rates" : {"civ" : ["contractor"]},
					"desc" : "The Supply Assistant is either a civilian Deck Technician, a Deck Technician in training, or both. The roles are otherwise identical in every respect.\n\nThey answer to normal Deck Technicians, the Deck Chief, and the Executive Officer, in ascending order of importance."
				},
				{
					"titles" : ["Prospector", "Drill Technician", "Shaft Miner", "Salvage Technician"],
					"rates" : {"civ" : ["contractor"]},
					"desc" : "The Prospector is a dedicated salvage, mining, archaeology, and specimen retrieval workhorse. They join in away missions in an attempt to retrieve valuable minerals, samples, and artifacts for use by the rest of the department.\n\nThe Prospector answers to the Research Director."
				}
			]
		},
		{
			"name": "Other",
			"jobs": [
				{
					"titles" : ["Passenger", "Journalist", "Historian", "Botanist", "Investor", "Naturalist", "Ecologist", "Entertainer", "Independent Observer", "Sociologist", "Trainer"],
					"rates" : {"civ" : ["civ"]},
					"desc" : "The Passenger is simply along for the ride. It has no authority and no responsibilities on board the Torch, and simply wanders the halls looking for ways to entertain itself. Utilize the alternate titles! They offer unique roleplay opportunities. Ecologists, Naturalists, and Historians may be able to convince the right people that they'd be valuable on an away mission. Botanists may be able to convince Explorers to let them take a look at plants retrieved from exoplanets. A Sociologist could go around and ask people questions about their workplace. An Entertainer could collaborate with the Bartender or Cook to create something interesting in the galley. As an Investor, try engaging with the Corporate Liaison, Captain and SCGR - flaunt your cash!\n\nThe Passenger has no department head. As such, the Executive Officer is responsible for ensuring that they stay out of trouble."
				}
			]
		}
	],
	"branches" : {
		"civ" : {
			"desc" : "Civilian",
			"rates" : [
				{
					"rate" : "civ",
					"name" : "Civilian",
					"abbrev" : "",
					"desc" : "You are a civilian, not contracted for a specific job on the Torch."
				},
				{
					"rate" : "contractor",
					"name" : "Contractor",
					"abbrev" : "",
					"desc" : "You are a contractor working for the Expeditionary Corps Organization, whether through independent contract or employment with one of the large corporations that makes up the bulk of the EXO workforce."
				}
			]
		},
		"ec" : {
			"desc" : "Expeditionary Corps",
			"rates" : [
				{
					"rate" : "E3",
					"name" : "Explorer",
					"abbrev" : "XPL",
					"desc" : "Congratulations, you passed basic training. Now you're off to more advanced training schools or your first assignment. You're probably still 18 or 19. You've just got to your first assignment. Congratulations! Most of your work is on the job training, unless you're something specialised, like engineering, medical or security, in which case you'll be having a fun couple of months getting to grips with your trade before most of your learning is done on the job. Your skills are basic, but you sure are eager! You'll be sitting at this rank for a long time though, given that it's the baseline for Expeds. Eventually you'll probably become pretty competent in your area and accustomed to ship life. As such, EC E-3's vary wildly in experience, length of service and competence compared to their DF counterparts. As such you could be around 18-28 on average."
				},
				{
					"rate" : "E5",
					"name" : "Senior Explorer",
					"abbrev" : "SXPL",
					"desc" : "Congratulations, you're on the NCO ladder. You're experienced, you've just been on a \"leadership course.\" Good luck. You're somewhat reliable, sensible and professional. You aren't making it past this grade unless you can show you can function in a hierarchy. You've had leadership training! You're expected to know your job pretty well, better than all those E-3's. You're expected to organise, specialise and maintain expeditionary operations on the lower level. You are the cog keeping the expedition machine turning. At least for most areas. In others, you are a specialist, someone who's skills and abilities mean they require more pay and a higher rank. E-5 is far broader in variety for the EC than the other branches."
				},
				{
					"rate" : "E7",
					"name" : "Chief Explorer",
					"abbrev" : "CXPL",
					"desc" : "Congratulations, you're an SNCO. People at this grade are experienced, long serving professionals. They don't make mistakes often, they know policy and protocol, and they don't do stupid shit. These people are the cream of the crop, the ones who know the regs, know their job, know their ship, know their duty and know how to talk to their superiors and subordinates alike. These are the people that keep the DF/EC from falling apart. You're a Chief Explorer now. The top of the EC Enlisted chain. You know your business, you've gone back to leadership school. You're expected to train, manage and look after specialists, coordinating your E-5's and helping with issues as they arise. You bridge the gap between EC Officers and their teams. You're a middleman, but a good one, with the skils and experience to back up what you know and to advise as you need. You've been in the EC for a damn long time and you'll be damned if you're going to let anyone let it look bad infront of the Defence Forces. You're probably between 28-40. You're expected to ensure the training of your subordinates is being carried out properly, you're also directly responsible for training junior officers in their duties."
				},
				{
					"rate" : "O1",
					"name" : "Ensign",
					"abbrev" : "ENS",
					"desc" : "Well you made it out of officer candidate/introductory school/the expeditionary academy. You're lean, mean and green. You might think you know it all, but in truth, Your E-7+'s are having to hold your hand through everything. You're the officer equivalent of an E-2. You've attended the expeditionary academy and learned how to be officery and things relevant to your area in the EC. For some, you're a specialist hired for your skills rather than your military/sciencey inclinations, as is the case for a doctor. Medical Doctor O-1's will generally be between 28-32, given they went to med school, and haven't had leadership training. All other O-1's are likely to be 23-25. Officers have degrees. They have been to university/college. This is the baseline officer rank, you can expect to be here for awhile until you've built up experience and skills and gone off for leadership training to be put incharge of something. Junior Officers may have a lot of overconfidence and bluster, they do not give shit to E-7+'s and their superior officers. They know this is a one way ticket to getting discharged."
				},
				{
					"rate" : "O3",
					"name" : "Lieutenant",
					"abbrev" : "LT",
					"desc" : "Congratulations, this is basically the middle of the board as far as officers go. You've got leadership training, experience and skills under your belt. You're the upper end of the \"Junior officers\" list. You can be expected to run whatever you've been put in charge of and to do a damn good job of it. You still take some guidance from your E-7's but you know when to handle things yourself and when to let them handle it now. You've shown your superiors you have what it takes. They're about on par with an E-6 in terms of experience, authority and skills. You're probably between 27-34 and have been given your own department/other thing to run. Junior Officers may have a lot of overconfidence and bluster, they do not give shit to E-7+'s and their superior officers. They know this is a one way ticket to getting discharged."
				},
				{
					"rate" : "O5",
					"name" : "Commander",
					"abbrev" : "CDR",
					"desc" : "You're pretty high up now, you may be the first/executive officer of a vessel, the Captains right hand or in charge of your own, smaller vessel. You're probably between 38-48. A leader, an administrator, a manager. You know your stuff. You lead, you set direction. You rarely go into the field yourself anymore though, sometimes, when the Captain needs things to get done, he may send you down. (Who knows how you may have somehow ended up as an XO on a ship.)"
				},
				{
					"rate" : "O6",
					"name" : "Captain",
					"abbrev" : "CAPT",
					"desc" : "Congratulations, you're right below flag officers and admirals. You're in command of a ship, station or maybe even a small flotilla of ships. You're probably between 44-60. You're the best your branch has to offer. You know your business, you have the political savvy to get your own (likely large/important) command and you know how to handle your subordinates, delegate like a champion and placate the admiralty. You're not going to get here by being an idiot. You are the final say aboard your ship and you know it. Be confident, but not stupid. You went to a senior staff school/college. Captains are competent, highly skilled and educated."
				}
			]
		},
		"fleet" : {
			"desc" : "Fleet",
			"rates" : [
				{
					"rate" : "E2",
					"name" : "Crewman Apprentice",
					"abbrev" : "CA",
					"desc" : "Congratulations, you passed basic training. Now you're off to more advanced training schools or your first assignment. You're probably still 18 or 19. You're probably getting taught basic drill and how to become accustomed to ship life and the basic tasks that you'll be expected to carry out before going onto more advanced training. Some basic weapons training included. You're probably going to have a deeply ingrained sense of respect for your institution and adherence to the chain of command has been drilled into you from day one."
				},
				{
					"rate" : "E3",
					"name" : "Crewman",
					"abbrev" : "CN",
					"desc" : "Congratulations, you're still junior enlisted, but you've shown you've got what it takes to progress. You have some skill or proficiency and the routine of military life is settling in. You're probably around 19-20. You're making good progress to your rating, you're still going between on the job and on base training and you've got those exams coming up, but you've finally mastered the basics. One day you'll have the respect you probably don't deserve and the rank to show it."
				},
				{
					"rate" : "E4",
					"name" : "Petty Officer Third Class",
					"abbrev" : "PO3",
					"desc" : "Congratulations, you're on the NCO ladder. You're probably 20-22. You're experienced, you've just been on a \"leadership course.\" Good luck. You're somewhat reliable, sensible and professional. You aren't making it past this grade unless you can show you can function in a hierarchy. You've finally earned your rating, you're now a fully fledged engineer/master at arms/corpsman/logistics specialist. You've been through the training, the exams and the lengthy courses and experience requirements necessary for someone to call you Petty Officer. You're expected to know your job, know the regs as they apply to it, are expected to do your job independently and with minimal supervision and are there to help train new Crewmen. Minor leadership training."
				},
				{
					"rate" : "E5",
					"name" : "Petty Officer Second Class",
					"abbrev" : "PO2",
					"desc" : "E-5+'s and above are not fuckups. Congratulations, you're climbing the ladder. You're probably between 21-26 now. You're an NCO, you know your business. Noone should have to tell you twice. You're competent, you know your area, you're responsible for others. You know how to stay out of trouble and you don't make common mistakes. Petty Officer Second Class now, you've had more training, more leadership training, more specialisation. You're pretty damn good at your area of work and you know your business to a pretty good level. You know your duties and you know all the little quirks and peculiarities of your job."
				},
				{
					"rate" : "E6",
					"name" : "Petty Officer First Class",
					"abbrev" : "PO1",
					"desc" : "E-5+'s and above are not fuckups. You're at the top of the ladder as far as people who know their speciality are concerned in most circumstances. You've had yet more leadership training, you've passed more exams and you know a damn lot about your area of work. More than most junior/middle level officers, actually."
				},
				{
					"rate" : "E7",
					"name" : "Chief Petty Officer",
					"abbrev" : "CPO",
					"desc" : "Congratulations, you're an SNCO. These people are the cream of the crop, the ones who know the regs, know their job, know their ship, know their duty and know how to talk to their superiors and subordinates alike. These are the people that keep the DF/EC from falling apart. You're probably between 28-40. You're expected to ensure the training of your subordinates is being carried out properly, you're also directly responsible for training junior officers in their duties. People at this grade and above are experienced, long serving professionals. They don't make mistakes often, they know policy and protocol, and they don't do stupid shit. You're a Chief Petty Officer. A highly selective process. You've gone to yet more leadership courses, you've been judged by a board of other SNCO's to get here. You know your job well, and the Fleet better. You organise, you delegate, you lead. You get your hands dirty when you have to, but you rarely have to. You're the one the officers come to when things need to happen. You're the one the enlisted some to when they have an obscure technical issue that needs fixing."
				},
				{
					"rate" : "E8",
					"name" : "Senior Chief Petty Officer",
					"abbrev" : "SCPO",
					"desc" : "People at this grade and above are experienced, long serving professionals. They don't make mistakes often, they know policy and protocol, and they don't do stupid shit. Senior Chief, you spend most of your time managing, advising, and assisting as needed. You're a master of delegation. You've been here a very long time. You know it all. And you know that you are not going to through away what you've earned and will earn by doing something stupid. You know your job inside and out, and the Fleet as a whole. Like an E-7, but more experienced in the arts of senior non-comming. You're probably between 34-48."
				},
				{
					"rate" : "E9",
					"name" : "Master Chief Petty Officer",
					"abbrev" : "MCPO",
					"desc" : "The top of the Enlisted food chain. You're probably between 38-54. This is it. You have the experience and length of service far outclassing most above you. You've been here longer than many Captains. One of the few. You know your business, you're someone who showed ambition as well as competence. Now you spend all your time advising, inspecting and doing paperwork. Your practical skills may drop a bit given your area of focus has moved toward the theoretical, but you're not someone to mess with. And most won't. You advise officers, you generally know best. If there was someone who was beyond reproach, this is them."
				},
				{
					"rate" : "E9a",
					"name" : "Command Master Chief Petty Officer",
					"abbrev" : "CMCPO",
					"desc" : "The top of the Enlisted food chain. You're probably between 38-54. This is it. You have the experience and length of service far outclassing most above you. You've been here longer than many Captains. One of the few. You know your business, you're someone who showed ambition as well as competence. Now you spend all your time advising, inspecting and doing paperwork. Your practical skills may drop a bit given your area of focus has moved toward the theoretical, but you're not someone to mess with. And most won't. You advise officers, you generally know best. If there was someone who was beyond reproach, this is them."
				},
				{
					"rate" : "O1",
					"name" : "Ensign",
					"abbrev" : "ENS",
					"desc" : "Well you made it out of officer candidate/introductory school/the expeditionary academy. You're lean, mean and green. You might think you know it all, but in truth, Your E-7+'s are having to hold your hand through everything. You're the officer equivalent of an E-2. You've either passed out of a mildly difficult training/testing school in the case of the Fleet, or attended the expeditionary academy and learned how to be officery and things relevant to your area in the EC. For some, you're a specialist hired for your skills rather than your military/sciencey inclinations, as is the case for a doctor. You're new, you're here, you're learning how to do your job under more experienced officers and SNCO's. You have the qualifications necessary to function at a basic level in your assigned area. You're probably in a junior officer position or a doctor. Medical Doctor O-1's will generally be between 28-32, given they went to med school. All other O-1's are likely to be 23-25. Officers have degrees. They have been to university/college. If you're a doctor, someone's probably taught you how to hold the military equivalent of a knife and fork properly. Your training was more about how to \"fit in\" and less about military bluster. You haven't had leadership training. That being said, you're expected to act like an officer, same as any other. Junior Officers may have a lot of overconfidence and bluster, they do not give shit to E-7+'s and their superior officers. They know this is a one way ticket to getting discharged."
				},
				{
					"rate" : "O2",
					"name" : "Sub-Lieutenant",
					"abbrev" : "SLT",
					"desc" : "You've been an O-1 for a year, you're starting to fit in, you've just got a promotion. You're probably 24-26. 28-32 if you're a doctor. You're now marginally more independent. But you're still learning. You're probably a staff officer or someone's maybe trusted you with more leadership and authority. You're settled in. You're probably still pretty motivated. Like an O-1 but with a year of service under their belt. Junior Officers may have a lot of overconfidence and bluster, they do not give shit to E-7+'s and their superior officers. They know this is a one way ticket to getting discharged."
				},
				{
					"rate" : "O3",
					"name" : "Lieutenant",
					"abbrev" : "LT",
					"desc" : "Congratulations, this is basically the middle of the board as far as officers go. You've got leadership training, experience and skills under your belt. You're the upper end of the \"Junior officers\" list. You can be expected to run whatever you've been put in charge of and to do a damn good job of it. You still take some guidance from your E-7's but you know when to handle things yourself and when to let them handle it now. You've shown your superiors you have what it takes. They're about on par with an E-6 in terms of experience, authority and skills. You're probably between 27-34 and have been given your own department/other thing to run. You may also be a MUSTANG. A former enlisted person who has now gotten a degree of some kind and has been promoted to an appropriate officer grade based on their skills and experience. Typically this only happens in the E-7/8 area, and these people get bumped up to O-3. If this is the case, you may be a bit more \"rough around the edges\" as an officer, but with far more enlisted savvy and experience in your area. Though, some other officers may look down upon you as \"not a proper officer.\" Junior Officers may have a lot of overconfidence and bluster, they do not give shit to E-7+'s and their superior officers. They know this is a one way ticket to getting discharged."
				},
				{
					"rate" : "O4",
					"name" : "Lieutenant Commander",
					"abbrev" : "LCDR",
					"desc" : "You're now heading into senior officer territory. You're even more administrative than you were before and far above any of that \"hands on work\" business. You're a professional, you no longer need the handholding of your E-7's. You set direction, give orders, make policies, confer with colleagues and liaise with different areas of staff. In the Fleet you're pretty much a pencil pusher, probably in charge of a smaller ship or a department on a very large on. You're roughly on par with an E-7 in the enlisted tree. You're probably between 30-42."
				},
				{
					"rate" : "O5",
					"name" : "Commander",
					"abbrev" : "CDR",
					"desc" : "You're pretty high up now, you may be the first/executive officer of a vessel, the Captains right hand or in charge of your own, smaller vessel. You're probably between 38-48. A leader, an administrator, a manager. You know your stuff. You lead, you set direction. You rarely go into the field yourself anymore though, sometimes, when the Captain needs things to get done, he may send you down. (Who knows how you may have somehow ended up as an XO on a ship.)"
				}
			]
		},
		"scg" : {
			"desc" : "Sol Central Government",
			"rates" : [
				{"rate" : "gov", "name" : "SolGov Representative", "abbrev" : ""},
				{"rate" : "agent", "name" : "OCIE Agent", "abbrev" : "Agent"},
				{"rate" : "scientist", "name" : "Government Scientist", "abbrev" : ""}
			]
		}
	}
}